	.section .text
.LNDBG_TX:
# mark_description "Intel(R) C Intel(R) 64 Compiler for applications running on Intel(R) 64, Version 17.0.2.174 Build 20170213";
# mark_description "-Wall -Wextra -march=native -Wno-parentheses -fno-tree-vectorize -fstrict-aliasing -fno-inline -O3 -g -S -o ";
# mark_description "add_8_inline.s";
	.file "add_8.c"
	.text
..TXTST0:
.L_2__routine_start_main_0:
# -- Begin  main
	.text
# mark_begin;
       .align    16,0x90
	.globl main
# --- main()
main:
..B1.1:                         # Preds ..B1.0
                                # Execution count [1.00e+00]
	.cfi_startproc
..___tag_value_main.2:
..L3:
                                                          #162.13
..LN0:
	.file   1 "add_8.c"
	.loc    1  162  is_stmt 1
        pushq     %rbp                                          #162.13
	.cfi_def_cfa_offset 16
..LN1:
        movq      %rsp, %rbp                                    #162.13
	.cfi_def_cfa 6, 16
	.cfi_offset 6, -16
..LN2:
        andq      $-128, %rsp                                   #162.13
..LN3:
        pushq     %r12                                          #162.13
..LN4:
        pushq     %r13                                          #162.13
..LN5:
        pushq     %r14                                          #162.13
..LN6:
        pushq     %r15                                          #162.13
..LN7:
        pushq     %rbx                                          #162.13
..LN8:

//	DW_AT_name:
	.2byte 0x3778
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_AT_location:
	.2byte 0x6701
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xa8
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3878
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_AT_location:
	.2byte 0x6701
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3179
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3279
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3379
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3479
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3579
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3679
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3779
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_AT_location:
	.2byte 0x6701
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x3879
	.byte 0x00
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_TAG_variable:
	.byte 0x0b
//	DW_AT_decl_line:
	.byte 0xab
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x36c
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_variable:
	.byte 0x0c
//	DW_AT_decl_line:
	.byte 0xad
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte .debug_str+0x371
//	DW_AT_type:
	.4byte 0x00000cca
//	DW_AT_location:
	.2byte 0x5c01
//	DW_TAG_lexical_block:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0xc1
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN383
//	DW_AT_high_pc:
	.8byte ..LN409
//	DW_TAG_variable:
	.byte 0x07
//	DW_AT_decl_line:
	.byte 0xc1
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_lexical_block:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0xc1
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN392
//	DW_AT_high_pc:
	.8byte ..LN399
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xc2
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.4byte 0x00706d74
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_AT_location:
	.2byte 0x9102
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_lexical_block:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0xca
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN417
//	DW_AT_high_pc:
	.8byte ..LN492
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xca
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x5f01
//	DW_TAG_lexical_block:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0xcc
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN426
//	DW_AT_high_pc:
	.8byte ..LN481
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xcc
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x5d01
	.byte 0x00
	.byte 0x00
//	DW_TAG_lexical_block:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0xd5
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN500
//	DW_AT_high_pc:
	.8byte ..LN575
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xd5
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x5d01
//	DW_TAG_lexical_block:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0xd7
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN509
//	DW_AT_high_pc:
	.8byte ..LN564
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xd7
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x5c01
	.byte 0x00
	.byte 0x00
//	DW_TAG_lexical_block:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0xe0
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN583
//	DW_AT_high_pc:
	.8byte ..LN658
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xe0
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x0069
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x5d01
//	DW_TAG_lexical_block:
	.byte 0x08
//	DW_AT_decl_line:
	.byte 0xe2
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_low_pc:
	.8byte ..LN592
//	DW_AT_high_pc:
	.8byte ..LN647
//	DW_TAG_variable:
	.byte 0x06
//	DW_AT_decl_line:
	.byte 0xe2
//	DW_AT_decl_file:
	.byte 0x01
//	DW_AT_name:
	.2byte 0x006a
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_location:
	.2byte 0x5c01
	.byte 0x00
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x00000922
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00000927
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x12d
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x04
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x132
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x0000093a
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x4a
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_name:
	.4byte .debug_str+0x13f
//	DW_AT_type:
	.4byte 0x00000945
//	DW_TAG_union_type:
	.byte 0x11
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_byte_size:
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x13f
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x36
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x147
//	DW_AT_type:
	.4byte 0x000009d8
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x3c
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x164
//	DW_AT_type:
	.4byte 0x000009e8
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x3d
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x16d
//	DW_AT_type:
	.4byte 0x000009f1
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x3e
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x17d
//	DW_AT_type:
	.4byte 0x00000a01
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x3f
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x187
//	DW_AT_type:
	.4byte 0x00000a0a
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x40
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x191
//	DW_AT_type:
	.4byte 0x00000a13
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x41
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x1a8
//	DW_AT_type:
	.4byte 0x00000a23
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x42
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x1c1
//	DW_AT_type:
	.4byte 0x00000a33
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x43
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x1cb
//	DW_AT_type:
	.4byte 0x00000a3c
//	DW_TAG_member:
	.byte 0x13
//	DW_AT_decl_line:
	.byte 0x49
//	DW_AT_decl_file:
	.byte 0x02
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.2byte 0x0063
//	DW_AT_type:
	.4byte 0x00000a4c
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000009e1
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x01
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x15f
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000927
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000009fa
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x177
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000033
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x000009e1
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x01
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000a1c
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x01
//	DW_AT_encoding:
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x19a
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000a2c
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x07
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x02
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x1b2
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x0000092e
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x03
	.byte 0x00
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000a45
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x01
	.byte 0x00
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x08
//	DW_AT_encoding:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x1d5
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000927
//	DW_AT_byte_size:
	.byte 0x10
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x0f
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x00000a5a
//	DW_TAG_const_type:
	.byte 0x0e
//	DW_AT_type:
	.4byte 0x00000a5f
//	DW_TAG_base_type:
	.byte 0x0f
//	DW_AT_byte_size:
	.byte 0x00
//	DW_AT_encoding:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1e3
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x2c
//	DW_AT_decl_file:
	.byte 0x03
//	DW_AT_name:
	.4byte .debug_str+0x1e8
//	DW_AT_type:
	.4byte 0x00000a45
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x37
//	DW_AT_decl_file:
	.byte 0x04
//	DW_AT_name:
	.4byte .debug_str+0x1f5
//	DW_AT_type:
	.4byte 0x00000a45
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x00000a81
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x30
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x1fe
//	DW_AT_type:
	.4byte 0x00000a8c
//	DW_TAG_structure_type:
	.byte 0x16
//	DW_AT_decl_line:
	.byte 0xf1
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_byte_size:
	.byte 0xd8
//	DW_AT_name:
	.4byte .debug_str+0x203
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xf2
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x20c
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xf7
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x213
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xf8
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x220
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xf9
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x22d
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xfa
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x20
//	DW_AT_name:
	.4byte .debug_str+0x23b
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xfb
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x28
//	DW_AT_name:
	.4byte .debug_str+0x24a
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xfc
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x30
//	DW_AT_name:
	.4byte .debug_str+0x258
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xfd
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x38
//	DW_AT_name:
	.4byte .debug_str+0x266
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xfe
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x40
//	DW_AT_name:
	.4byte .debug_str+0x273
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0100
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x48
//	DW_AT_name:
	.4byte .debug_str+0x27f
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0101
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x50
//	DW_AT_name:
	.4byte .debug_str+0x28d
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0102
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x58
//	DW_AT_name:
	.4byte .debug_str+0x29d
//	DW_AT_type:
	.4byte 0x00000c4b
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0104
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x60
//	DW_AT_name:
	.4byte .debug_str+0x2aa
//	DW_AT_type:
	.4byte 0x00000c50
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0106
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x68
//	DW_AT_name:
	.4byte .debug_str+0x2cf
//	DW_AT_type:
	.4byte 0x00000c88
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0108
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x70
//	DW_AT_name:
	.4byte .debug_str+0x2d6
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x010c
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x74
//	DW_AT_name:
	.4byte .debug_str+0x2de
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x010e
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x78
//	DW_AT_name:
	.4byte .debug_str+0x2e6
//	DW_AT_type:
	.4byte 0x00000c8d
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0112
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01802303
//	DW_AT_name:
	.4byte .debug_str+0x2fa
//	DW_AT_type:
	.4byte 0x00000a2c
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0113
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01822303
//	DW_AT_name:
	.4byte .debug_str+0x306
//	DW_AT_type:
	.4byte 0x00000927
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0114
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01832303
//	DW_AT_name:
	.4byte .debug_str+0x315
//	DW_AT_type:
	.4byte 0x00000c98
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0118
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01882303
//	DW_AT_name:
	.4byte .debug_str+0x31f
//	DW_AT_type:
	.4byte 0x00000ca1
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0121
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01902303
//	DW_AT_name:
	.4byte .debug_str+0x2ea
//	DW_AT_type:
	.4byte 0x00000cb1
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0129
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01982303
//	DW_AT_name:
	.4byte .debug_str+0x33a
//	DW_AT_type:
	.4byte 0x00000cbc
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x012a
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01a02303
//	DW_AT_name:
	.4byte .debug_str+0x341
//	DW_AT_type:
	.4byte 0x00000cbc
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x012b
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01a82303
//	DW_AT_name:
	.4byte .debug_str+0x348
//	DW_AT_type:
	.4byte 0x00000cbc
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x012c
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01b02303
//	DW_AT_name:
	.4byte .debug_str+0x34f
//	DW_AT_type:
	.4byte 0x00000cbc
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x012e
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01b82303
//	DW_AT_name:
	.4byte .debug_str+0x356
//	DW_AT_type:
	.4byte 0x00000a66
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x012f
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01c02303
//	DW_AT_name:
	.4byte .debug_str+0x35d
//	DW_AT_type:
	.4byte 0x00000033
//	DW_TAG_member:
	.byte 0x17
//	DW_AT_decl_line:
	.2byte 0x0131
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.4byte 0x01c42303
//	DW_AT_name:
	.4byte .debug_str+0x363
//	DW_AT_type:
	.4byte 0x00000cc1
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x00000927
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x00000c55
//	DW_TAG_structure_type:
	.byte 0x16
//	DW_AT_decl_line:
	.byte 0x9c
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_byte_size:
	.byte 0x18
//	DW_AT_name:
	.4byte .debug_str+0x2b3
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x9d
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x00
//	DW_AT_name:
	.4byte .debug_str+0x2be
//	DW_AT_type:
	.4byte 0x00000c50
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0x9e
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x08
//	DW_AT_name:
	.4byte .debug_str+0x2c4
//	DW_AT_type:
	.4byte 0x00000c88
//	DW_TAG_member:
	.byte 0x12
//	DW_AT_decl_line:
	.byte 0xa2
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_data_member_location:
	.2byte 0x2302
	.byte 0x10
//	DW_AT_name:
	.4byte .debug_str+0x2ca
//	DW_AT_type:
	.4byte 0x00000033
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x00000a8c
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x83
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x2f2
//	DW_AT_type:
	.4byte 0x000009e1
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000927
//	DW_AT_byte_size:
	.byte 0x01
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x00
	.byte 0x00
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x00000ca6
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x96
//	DW_AT_decl_file:
	.byte 0x06
//	DW_AT_name:
	.4byte .debug_str+0x325
//	DW_AT_type:
	.4byte 0x00000a5f
//	DW_TAG_typedef:
	.byte 0x10
//	DW_AT_decl_line:
	.byte 0x84
//	DW_AT_decl_file:
	.byte 0x07
//	DW_AT_name:
	.4byte .debug_str+0x330
//	DW_AT_type:
	.4byte 0x000009e1
//	DW_TAG_pointer_type:
	.byte 0x0d
//	DW_AT_type:
	.4byte 0x00000a5f
//	DW_TAG_array_type:
	.byte 0x14
//	DW_AT_type:
	.4byte 0x00000927
//	DW_AT_byte_size:
	.byte 0x14
//	DW_TAG_subrange_type:
	.byte 0x15
//	DW_AT_upper_bound:
	.byte 0x13
	.byte 0x00
//	DW_TAG_restrict_type:
	.byte 0x18
//	DW_AT_type:
	.4byte 0x00000935
//	DW_TAG_variable:
	.byte 0x19
//	DW_AT_decl_line:
	.byte 0xa9
//	DW_AT_decl_file:
	.byte 0x05
//	DW_AT_name:
	.4byte .debug_str+0x3bc
//	DW_AT_type:
	.4byte 0x00000c88
//	DW_AT_declaration:
	.byte 0x01
//	DW_AT_external:
	.byte 0x01
	.byte 0x00
// -- Begin DWARF2 SEGMENT .debug_line
	.section .debug_line
.debug_line_seg:
	.align 1
// -- Begin DWARF2 SEGMENT .debug_abbrev
	.section .debug_abbrev
.debug_abbrev_seg:
	.align 1
	.byte 0x01
	.byte 0x11
	.byte 0x01
	.byte 0x1b
	.byte 0x0e
	.byte 0x03
	.byte 0x0e
	.byte 0x25
	.byte 0x0e
	.2byte 0x7681
	.byte 0x0e
	.byte 0x13
	.byte 0x0b
	.byte 0x53
	.byte 0x0c
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x6a
	.byte 0x0c
	.byte 0x10
	.byte 0x17
	.2byte 0x0000
	.byte 0x02
	.byte 0x24
	.byte 0x00
	.byte 0x0b
	.byte 0x0b
	.byte 0x3e
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.2byte 0x0000
	.byte 0x03
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x27
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x40
	.byte 0x18
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x04
	.byte 0x05
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x08
	.byte 0x02
	.byte 0x18
	.2byte 0x0000
	.byte 0x05
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x27
	.byte 0x0c
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x06
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.byte 0x49
	.byte 0x13
	.byte 0x02
	.byte 0x18
	.2byte 0x0000
	.byte 0x07
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x08
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x08
	.byte 0x0b
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x01
	.2byte 0x0000
	.byte 0x09
	.byte 0x0b
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.2byte 0x0000
	.byte 0x0a
	.byte 0x2e
	.byte 0x01
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x49
	.byte 0x13
	.byte 0x03
	.byte 0x0e
	.2byte 0x4087
	.byte 0x0e
	.byte 0x40
	.byte 0x18
	.byte 0x11
	.byte 0x01
	.byte 0x12
	.byte 0x07
	.byte 0x6a
	.byte 0x0c
	.byte 0x3f
	.byte 0x0c
	.2byte 0x0000
	.byte 0x0b
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
	.2byte 0x0000
	.byte 0x0c
	.byte 0x34
	.byte 0x00
	.byte 0x3b
	.byte 0x0b
	.byte 0x3a
	.byte 0x0b
	.byte 0x03
	.byte 0x0e
	.byte 0x49
	.byte 0x13
